УТ_для_edt.РасширениеСмарт/src/Documents/CRM_Взаимодействие/CRM_Взаимодействие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="df302bde-3a33-4b81-8826-adc0bd3d8cf1">
  <name>CRM_Взаимодействие</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Skype</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтакнаяИнформацияПартнераАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартОсновнойМенеджерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартДилерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перепродавец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерКонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерТелефонКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПропускнаяСистема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставкиТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерПлатильщикЗаДоставкуГруза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="431ea12d-0bcd-44da-8c13-8fd3e3e1a591">
    <name>смартДилерБывший</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d8288f2-9450-4c32-b3b2-af0cc494cf90">
    <name>смартКлючевойКлиентПоРасходнымМатериалам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОборудованиеКлиентов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартНаименованиеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартОборудованиеКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартЧернилаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартЧернилаКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a039b99d-5c3e-46bf-b321-17891d574d3e">
    <name>смартВидыДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b5fe9406-a0b5-49eb-9e30-99dd19a7a18b">
      <name>ВидДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c9650fb8-3e0f-4ca1-b198-3b3d9b8f018c">
    <name>смартТипичноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="082a786c-a92a-457f-bce6-eb2074d564f5">
      <name>ТипичноеОборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Documents/CRM_Взаимодействие/ObjectModule.bsl
#Область ПеренесеноСДоработкамиСмарт

&После("ПриЗаписи")
//++ #1929 смарт: Фролов 23.07.2024 //УстановитьПривилегированныйРежим как в Прод
Процедура смарт_ПриЗаписи(Отказ)
	
	//++ #Б-2008 смарт: Фролов 31.01.2025 //убрать изменения по ручному созданию лидов из расширения
	УстановитьПривилегированныйРежим(Истина);
	//-- #Б-2008 смарт: Фролов 31.01.2025
	
	НаборЗаписей = РегистрыСведений.смартЖурналЗадачИВзаимодействий.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Объект.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	Запись = НаборЗаписей.Добавить();
	Запись.Объект = Ссылка;
	Запись.Дата = ПлановаяДата;
	Запись.Время = ПлановаяДатаЗавершение;
	Запись.Предмет = ?(ЗначениеЗаполнено(ДокументОснование), ДокументОснование, Партнер);
	Запись.Партнер = Партнер;
	Запись.Контакт = КонтактноеЛицо;
	Запись.Исполнитель = Ответственный;
	Запись.Автор = Автор;
	Запись.Состояние = СтатусВзаимодействия;
	Запись.ДатаЗавершения = ДатаЗавершенияВзаимодействия;
	Запись.Вид = ВидВзаимодействия;
	Запись.Тип = Перечисления.смартТипыДелСотрудников.Взаимодействие;
	Запись.РучноеДобавление = смартРучноеДобавление;
	НаборЗаписей.Записать(Истина);
	
	Если СтатусВзаимодействия=Справочники.CRM_СостоянияСобытий.Отменено
		ИЛИ СтатусВзаимодействия=Справочники.CRM_СостоянияСобытий.Завершено
		ИЛИ ПометкаУдаления Тогда
		
		//++ #1935 смарт: Фролов 03.09.2024 //Удаление оповещений по выполненным задачам
		НаборЗаписей = РегистрыСведений.НапоминанияПользователя.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Источник.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
		//-- #1935 смарт: Фролов 03.09.2024 
		
		//++ #Б-2208 смарт: Фролов 03.03.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
		//Запрос = Новый Запрос(
		//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//|	Ссылка КАК Ссылка
		//|ИЗ
		//|	БизнесПроцесс.CRM_БизнесПроцесс
		//|ГДЕ
		//|	Предмет = &Предмет
		//|	И ДатаЗавершения = ДАТАВРЕМЯ(1,1,1)
		//|	И НЕ ПометкаУдаления
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	Ссылка
		//|ИЗ
		//|	Задача.ЗадачаИсполнителя
		//|ГДЕ
		//|	НЕ ПометкаУдаления
		//|	И ДатаИсполнения = ДАТАВРЕМЯ(1,1,1) 
		//|	И Предмет = &Предмет");
		//Запрос.УстановитьПараметр("Предмет", Ссылка);
		//
		//Выборка = Запрос.Выполнить().Выбрать();
		//
		//Пока Выборка.Следующий() Цикл
		//	
		//	ОбъектОбработки = Выборка.Ссылка.ПолучитьОбъект();
		//	ОбъектОбработки.ПометкаУдаления = Истина;
		//	
		//	Если ТипЗнч(Выборка.Ссылка) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		//		ОбъектОбработки.ДатаИсполнения = ТекущаяДата();
		//		ОбъектОбработки.CRM_Неудача = Истина;
		//	Иначе
		//		ОбъектОбработки.ДатаЗавершения = ТекущаяДата();
		//	КонецЕсли;
		//	
		//	ОбъектОбработки.Записать();
		//	
		//КонецЦикла;
		//-- #Б-2208 смарт: Фролов 03.03.2025
		
	КонецЕсли;
	
	//++ #Б-3360 смарт: Фролов 22.05.2025 //Взаимодействия. Ошибка доступа. //Установлены РАЗРЕШЕННЫЕ для всех выворок
	//++ #Б-2372 смарт: Фролов 18.02.2025 //Пересчет регистра состояние партнеров при проведении Взаимодействия.
	Если ЗначениеЗаполнено(Партнер) Тогда
	
		УстановитьПривилегированныйРежим(Ложь);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	CRM_Интерес.Партнер КАК Партнер
		|ИЗ
		|	Документ.CRM_Интерес КАК CRM_Интерес
		|ГДЕ
		|	НЕ CRM_Интерес.Завершен
		|	И CRM_Интерес.Ответственный = CRM_Интерес.Партнер.ОсновнойМенеджер
		|	И НЕ CRM_Интерес.ПометкаУдаления
		|	И CRM_Интерес.Партнер = &Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Партнер КАК Партнер,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВложенныйЗапрос.ДатаПоследнегоВзаимодействия > ВложенныйЗапрос.ДатаЗаметки
		|				ТОГДА ВложенныйЗапрос.ДатаПоследнегоВзаимодействия
		|			ИНАЧЕ ВложенныйЗапрос.ДатаЗаметки
		|		КОНЕЦ) КАК ДатаПоследнегоВзаимодействия
		|ИЗ
		|	(ВЫБРАТЬ
		|		CRM_Взаимодействие.Партнер КАК Партнер,
		|		МАКСИМУМ(CRM_Взаимодействие.ДатаЗавершенияВзаимодействия) КАК ДатаПоследнегоВзаимодействия,
		|		МАКСИМУМ(ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗаметки
		|	ИЗ
		|		Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|	ГДЕ
		|		НЕ CRM_Взаимодействие.ПометкаУдаления
		|		И CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
		|		И CRM_Взаимодействие.Ответственный = CRM_Взаимодействие.Партнер.ОсновнойМенеджер
		|		И CRM_Взаимодействие.Партнер = &Партнер
		//++ #Б-4650 смарт: Фролов 10.10.2025 //Ошибка. Акционные взаимодействия не должны влиять на регламент!
		//++ #Б-3568 смарт: Фролов 17.06.2025 //Корректировка работы с взаимодействиями. Регламент оборудование.
		|		И CRM_Взаимодействие.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ПустаяСсылка)
		//-- #Б-3568 смарт: Фролов 17.06.2025
		//-- #Б-4650 смарт: Фролов 10.10.2025
		|	
		|	СГРУППИРОВАТЬ ПО
		|		CRM_Взаимодействие.Партнер
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА Заметки.Предмет ССЫЛКА Справочник.Партнеры
		|				ТОГДА Заметки.Предмет
		|			ИНАЧЕ Заметки.смартПартнер
		|		КОНЕЦ,
		|		МАКСИМУМ(ДАТАВРЕМЯ(1, 1, 1)),
		|		МАКСИМУМ(Заметки.ДатаЗаметки)
		|	ИЗ
		|		Справочник.Заметки КАК Заметки
		|	ГДЕ
		|		НЕ Заметки.ПометкаУдаления
		|		И ВЫБОР
		|				КОГДА Заметки.Предмет ССЫЛКА Справочник.Партнеры
		|					ТОГДА Заметки.Предмет.ОсновнойМенеджер
		|				ИНАЧЕ Заметки.смартПартнер.ОсновнойМенеджер
		|			КОНЕЦ = Заметки.Автор
		|		И Заметки.ДатаЗаметки < ДАТАВРЕМЯ(2024, 12, 16)
		|		И Заметки.Предмет = &Партнер
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВЫБОР
		|			КОГДА Заметки.Предмет ССЫЛКА Справочник.Партнеры
		|				ТОГДА Заметки.Предмет
		|			ИНАЧЕ Заметки.смартПартнер
		|		КОНЕЦ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		//++ #Б-2436 смарт: Фролов 07.03.2025 //Ввод нового регламента. Учитывать выставленные Заказы клиентов как завершенные взаимодействия.
		|	ВЫБРАТЬ
		|		ЗаказКлиента.Партнер,
		|		МАКСИМУМ(ЗаказКлиента.Дата),
		|		МАКСИМУМ(ДАТАВРЕМЯ(1, 1, 1))
		|	ИЗ
		|		Документ.ЗаказКлиента КАК ЗаказКлиента
		|	ГДЕ
		|		ЗаказКлиента.Проведен
		|		И ЗаказКлиента.Менеджер = ЗаказКлиента.Партнер.ОсновнойМенеджер
		|		И ЗаказКлиента.Партнер = &Партнер
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЗаказКлиента.Партнер) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Партнер
		|;
		//-- #Б-2436 смарт: Фролов 07.03.2025
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CRM_Взаимодействие.Партнер КАК Партнер,
		|	МАКСИМУМ(CRM_Взаимодействие.Дата) КАК Дата,
		|	МАКСИМУМ(CRM_Взаимодействие.ПлановаяДата) КАК ДатаЗапланированногоВзаимодействия
		//++ #Б-3856 смарт: Фролов 17.07.2025 //Ошибка. Расхождение в механизмах расчета состояния партнера!
		|ПОМЕСТИТЬ ЗапланированныеВзаимодействия
		//-- #Б-3856 смарт: Фролов 17.07.2025
		|ИЗ
		|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|ГДЕ
		|	НЕ CRM_Взаимодействие.ПометкаУдаления
		|	И НЕ CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
		|	И НЕ CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Отменено)
		|	И CRM_Взаимодействие.Ответственный = CRM_Взаимодействие.Партнер.ОсновнойМенеджер
		|	И CRM_Взаимодействие.Партнер = &Партнер
		//++ #Б-3568 смарт: Фролов 17.06.2025 //Корректировка работы с взаимодействиями. Регламент оборудование.
		|	И CRM_Взаимодействие.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ПустаяСсылка)
		//-- #Б-3568 смарт: Фролов 17.06.2025
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Взаимодействие.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартИсторияЗакрепленияПартнеровСрезПоследних.Партнер КАК Партнер,
		|	смартИсторияЗакрепленияПартнеровСрезПоследних.Период КАК Период,
		|	смартИсторияЗакрепленияПартнеровСрезПоследних.Менеджер КАК Менеджер
		|ИЗ
		|	РегистрСведений.смартИсторияЗакрепленияПартнеров.СрезПоследних КАК смартИсторияЗакрепленияПартнеровСрезПоследних
		|ГДЕ
		|	НЕ смартИсторияЗакрепленияПартнеровСрезПоследних.Менеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	И смартИсторияЗакрепленияПартнеровСрезПоследних.ТипУслуги = ЗНАЧЕНИЕ(Справочник.CRM_ТипУслуги.ПоставкаТоварыУслуги)
		|	И смартИсторияЗакрепленияПартнеровСрезПоследних.Партнер = &Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТелефонныйЗвонок.АбонентКонтакт КАК Партнер,
		|	МАКСИМУМ(ТелефонныйЗвонок.Дата) КАК ДатаПоследнегоЗвонка
		|ИЗ
		|	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
		|ГДЕ
		|	НЕ ТелефонныйЗвонок.ПометкаУдаления
		|	И ТелефонныйЗвонок.АбонентКонтакт ССЫЛКА Справочник.Партнеры
		|	И ТелефонныйЗвонок.Ответственный = ТелефонныйЗвонок.АбонентКонтакт.ОсновнойМенеджер
		|	И ТелефонныйЗвонок.АбонентКонтакт = &Партнер
		|
		|СГРУППИРОВАТЬ ПО
		|	ТелефонныйЗвонок.АбонентКонтакт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CRM_Взаимодействие.Партнер КАК Партнер,
		|	МАКСИМУМ(РАЗНОСТЬДАТ(CRM_Взаимодействие.Дата, CRM_Взаимодействие.ПлановаяДата, ДЕНЬ)) КАК ПредельныйСрок
		|ИЗ
		|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|ГДЕ
		|	НЕ CRM_Взаимодействие.ПометкаУдаления
		|	И НЕ CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
		|	И НЕ CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Отменено)
		|	И CRM_Взаимодействие.Ответственный = CRM_Взаимодействие.Партнер.ОсновнойМенеджер
		|	И CRM_Взаимодействие.смартСогласованоУвеличенияПлановогоСрока
		//++ #Б-3568 смарт: Фролов 17.06.2025 //Корректировка работы с взаимодействиями. Регламент оборудование.
		|	И CRM_Взаимодействие.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ПустаяСсылка)
		//-- #Б-3568 смарт: Фролов 17.06.2025
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Взаимодействие.Партнер
		|;
		|
		//++ #Б-2782 смарт: Фролов 25.03.2025 //Ввод нового регламента РМ. Доработка механизма заполнения регистра Состояние партнеров.
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CRM_Взаимодействие.Партнер КАК Партнер,
		|	МАКСИМУМ(CRM_Взаимодействие.ДатаЗавершенияВзаимодействия) КАК ДатаПоследнегоВзаимодействия
		|ИЗ
		|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|ГДЕ
		|	CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
		|	И НЕ CRM_Взаимодействие.ПометкаУдаления
		|	И CRM_Взаимодействие.Ответственный = CRM_Взаимодействие.Партнер.смартМенеджерПоРасходнымМатериалам
		|	И CRM_Взаимодействие.Партнер = &Партнер
		//++ #Б-5852 смарт: Фролов 25.02.2026 //Сделать акционное взаимодействие по РМ влияющее на трегламент.
		//++ #Б-4650 смарт: Фролов 10.10.2025 //Ошибка. Акционные взаимодействия не должны влиять на регламент!
		//++ #Б-3568 смарт: Фролов 17.06.2025 //Корректировка работы с взаимодействиями. Регламент оборудование.
		//|		И CRM_Взаимодействие.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ПустаяСсылка)
		//-- #Б-3568 смарт: Фролов 17.06.2025
		//-- #Б-4650 смарт: Фролов 10.10.2025
		//-- #Б-5852 смарт: Фролов 25.02.2026
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Взаимодействие.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CRM_Взаимодействие.Партнер КАК Партнер,
		|	МАКСИМУМ(CRM_Взаимодействие.ПлановаяДата) КАК ДатаЗапланированногоВзаимодействия
		//++ #Б-6096 смарт: Фролов 24.03.2026 //Доработки регламента РМ.
		|ПОМЕСТИТЬ ЗапланированныеВзаимодействияРМ
		//-- #Б-6096 смарт: Фролов 24.03.2026
		|ИЗ
		|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|ГДЕ
		|	НЕ CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
		|	И НЕ CRM_Взаимодействие.ПометкаУдаления
		|	И CRM_Взаимодействие.Ответственный = CRM_Взаимодействие.Партнер.смартМенеджерПоРасходнымМатериалам
		|	И CRM_Взаимодействие.Партнер = &Партнер
		//++ #Б-3568 смарт: Фролов 17.06.2025 //Корректировка работы с взаимодействиями. Регламент оборудование.
		|	И CRM_Взаимодействие.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ПустаяСсылка)
		//-- #Б-3568 смарт: Фролов 17.06.2025
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Взаимодействие.Партнер
		|;
		|
		//-- #Б-2782 смарт: Фролов 25.03.2025
		//++ #Б-2484 смарт: Фролов 07.03.2025 //Ввод нового регламента СЦ. Доработка механизма заполнения регистра Состояние партнеров.
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CRM_Взаимодействие.Партнер КАК Партнер,
		|	МАКСИМУМ(CRM_Взаимодействие.ДатаЗавершенияВзаимодействия) КАК ДатаПоследнегоВзаимодействия
		|ИЗ
		|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|ГДЕ
		|	CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
		|	И НЕ CRM_Взаимодействие.ПометкаУдаления
		|	И CRM_Взаимодействие.Ответственный = CRM_Взаимодействие.Партнер.смартОсновнойМенеджерСервисЦентра
		|	И CRM_Взаимодействие.Партнер = &Партнер
		//++ #Б-5750 смарт: Фролов 16.02.2026 //Доработка регламента СЦ при акционных взаимодействиях.
		//++ #Б-4650 смарт: Фролов 10.10.2025 //Ошибка. Акционные взаимодействия не должны влиять на регламент!
		//++ #Б-3568 смарт: Фролов 17.06.2025 //Корректировка работы с взаимодействиями. Регламент оборудование.
		//|		И CRM_Взаимодействие.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ПустаяСсылка)
		//-- #Б-3568 смарт: Фролов 17.06.2025
		//-- #Б-4650 смарт: Фролов 10.10.2025
		//-- #Б-5750 смарт: Фролов 16.02.2026
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Взаимодействие.Партнер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CRM_Взаимодействие.Партнер КАК Партнер,
		|	МАКСИМУМ(CRM_Взаимодействие.ПлановаяДата) КАК ДатаЗапланированногоВзаимодействия
		|ИЗ
		|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|ГДЕ
		|	НЕ CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
		|	И НЕ CRM_Взаимодействие.ПометкаУдаления
		|	И CRM_Взаимодействие.Ответственный = CRM_Взаимодействие.Партнер.смартОсновнойМенеджерСервисЦентра
		|	И CRM_Взаимодействие.Партнер = &Партнер
		//++ #Б-3568 смарт: Фролов 17.06.2025 //Корректировка работы с взаимодействиями. Регламент оборудование.
		|	И CRM_Взаимодействие.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ПустаяСсылка)
		//-- #Б-3568 смарт: Фролов 17.06.2025
		|
		|СГРУППИРОВАТЬ ПО
		|	CRM_Взаимодействие.Партнер
		//-- #Б-2484 смарт: Фролов 07.03.2025
		//++ #Б-3070 смарт: Фролов 16.04.2025 //Ошибка. Исправить различие в расчете состояний партнеров при проведении взаимодействий.
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	смартПредопределенныеЗначенияГруппыНоменклатурыРасходка.ГруппаНоменклатуры КАК ГруппаНоменклатуры
		|ПОМЕСТИТЬ ГруппыРасходки
		|ИЗ
		|	Справочник.смартПредопределенныеЗначения.ГруппыНоменклатурыРасходка КАК смартПредопределенныеЗначенияГруппыНоменклатурыРасходка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
		|	МАКСИМУМ(ВыручкаИСебестоимостьПродажОбороты.Период) КАК ДатаПродажиМенеджераРМ
		|ИЗ
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			АналитикаУчетаНоменклатуры.Номенклатура В ИЕРАРХИИ
		|					(ВЫБРАТЬ
		|						ГруппыРасходки.ГруппаНоменклатуры
		|					ИЗ
		|						ГруппыРасходки)
		|				И АналитикаУчетаПоПартнерам.Партнер = &Партнер
		|				И Менеджер = АналитикаУчетаПоПартнерам.Партнер.смартМенеджерПоРасходнымМатериалам) КАК ВыручкаИСебестоимостьПродажОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам.Партнер
		//-- #Б-3070 смарт: Фролов 16.04.2025
		//-- #Б-3360 смарт: Фролов 22.05.2025
		//++ #Б-3856 смарт: Фролов 17.07.2025 //Ошибка. Расхождение в механизмах расчета состояния партнера!
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	смартИсторияСтатусовСотрудниковСрезПоследних.Пользователь КАК Менеджер,
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(&ТекущаяДата, ДОБАВИТЬКДАТЕ(смартИсторияСтатусовСотрудниковСрезПоследних.ДатаОтсрочкиПоОтпуску, ДЕНЬ, РАЗНОСТЬДАТ(смартИсторияСтатусовСотрудниковСрезПоследних.Период, смартИсторияСтатусовСотрудниковСрезПоследних.ДатаОтсрочкиПоОтпуску, ДЕНЬ) / 2), ДЕНЬ) > 0
		|			ТОГДА РАЗНОСТЬДАТ(&ТекущаяДата, ДОБАВИТЬКДАТЕ(смартИсторияСтатусовСотрудниковСрезПоследних.ДатаОтсрочкиПоОтпуску, ДЕНЬ, РАЗНОСТЬДАТ(смартИсторияСтатусовСотрудниковСрезПоследних.Период, смартИсторияСтатусовСотрудниковСрезПоследних.ДатаОтсрочкиПоОтпуску, ДЕНЬ) / 2), ДЕНЬ)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДнейОтсрочки,
		|	ВЫБОР
		|		КОГДА РАЗНОСТЬДАТ(&ТекущаяДата, смартИсторияСтатусовСотрудниковСрезПоследних.ДатаОтсрочкиПоОтпуску, ДЕНЬ) < 0
		|			ТОГДА РАЗНОСТЬДАТ(смартИсторияСтатусовСотрудниковСрезПоследних.Период, смартИсторияСтатусовСотрудниковСрезПоследних.ДатаОтсрочкиПоОтпуску, ДЕНЬ)
		|		ИНАЧЕ РАЗНОСТЬДАТ(смартИсторияСтатусовСотрудниковСрезПоследних.Период, смартИсторияСтатусовСотрудниковСрезПоследних.ДатаОтсрочкиПоОтпуску, ДЕНЬ) - РАЗНОСТЬДАТ(&ТекущаяДата, смартИсторияСтатусовСотрудниковСрезПоследних.ДатаОтсрочкиПоОтпуску, ДЕНЬ)
		|	КОНЕЦ КАК ДнейИспользовано,
		|	РАЗНОСТЬДАТ(смартИсторияСтатусовСотрудниковСрезПоследних.Период, смартИсторияСтатусовСотрудниковСрезПоследних.ДатаОтсрочкиПоОтпуску, ДЕНЬ) КАК ДнейОтпуска,
		|	ДОБАВИТЬКДАТЕ(смартИсторияСтатусовСотрудниковСрезПоследних.ДатаОтсрочкиПоОтпуску, ДЕНЬ, РАЗНОСТЬДАТ(смартИсторияСтатусовСотрудниковСрезПоследних.Период, смартИсторияСтатусовСотрудниковСрезПоследних.ДатаОтсрочкиПоОтпуску, ДЕНЬ) / 2) КАК ПоследняяДатаОтсрочки
		|ИЗ
		|	РегистрСведений.смартИсторияСтатусовСотрудников.СрезПоследних КАК смартИсторияСтатусовСотрудниковСрезПоследних
		|ГДЕ
		|	НЕ смартИсторияСтатусовСотрудниковСрезПоследних.ДатаОтсрочкиПоОтпуску = ДАТАВРЕМЯ(1, 1, 1)
		|	И ДОБАВИТЬКДАТЕ(смартИсторияСтатусовСотрудниковСрезПоследних.ДатаОтсрочкиПоОтпуску, ДЕНЬ, РАЗНОСТЬДАТ(смартИсторияСтатусовСотрудниковСрезПоследних.Период, смартИсторияСтатусовСотрудниковСрезПоследних.ДатаОтсрочкиПоОтпуску, ДЕНЬ) / 2) >= &ТекущаяДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	CRM_Взаимодействие.Партнер КАК Партнер,
		|	CRM_Взаимодействие.Дата КАК Дата,
		|	CRM_Взаимодействие.ПлановаяДата КАК ДатаЗапланированногоВзаимодействия,
		|	CRM_Взаимодействие.смартСогласованоУвеличенияПлановогоСрока КАК СогласованоУвеличенияПлановогоСрока
		|ИЗ
		|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗапланированныеВзаимодействия КАК ЗапланированныеВзаимодействия
		|		ПО CRM_Взаимодействие.Партнер = ЗапланированныеВзаимодействия.Партнер
		|			И CRM_Взаимодействие.ПлановаяДата = ЗапланированныеВзаимодействия.ДатаЗапланированногоВзаимодействия
		|ГДЕ
		|	НЕ CRM_Взаимодействие.ПометкаУдаления
		|	И НЕ CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
		|	И НЕ CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Отменено)
		|	И CRM_Взаимодействие.Ответственный = CRM_Взаимодействие.Партнер.ОсновнойМенеджер
		|	И CRM_Взаимодействие.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ПустаяСсылка)
		//++ #Б-6096 смарт: Фролов 24.03.2026 //Доработки регламента РМ.
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CRM_Взаимодействие.Партнер КАК Партнер,
		|	CRM_Взаимодействие.ПлановаяДата КАК ДатаЗапланированногоВзаимодействия,
		|	CRM_Взаимодействие.Дата КАК Дата
		|ИЗ
		|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗапланированныеВзаимодействияРМ КАК ЗапланированныеВзаимодействияРМ
		|		ПО CRM_Взаимодействие.Партнер = ЗапланированныеВзаимодействияРМ.Партнер
		|			И CRM_Взаимодействие.ПлановаяДата = ЗапланированныеВзаимодействияРМ.ДатаЗапланированногоВзаимодействия
		|ГДЕ
		|	НЕ CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
		|	И НЕ CRM_Взаимодействие.ПометкаУдаления
		|	И CRM_Взаимодействие.Ответственный = CRM_Взаимодействие.Партнер.смартМенеджерПоРасходнымМатериалам
		|	И CRM_Взаимодействие.Партнер = &Партнер
		|	И CRM_Взаимодействие.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ПустаяСсылка)");
		//-- #Б-6096 смарт: Фролов 24.03.2026
		//-- #Б-3856 смарт: Фролов 17.07.2025
		
		Запрос.УстановитьПараметр("Партнер", Партнер);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		
		МассивРезультаров = Запрос.ВыполнитьПакет();
		ТабИнтересы = МассивРезультаров[0].Выгрузить();
		ТабПоследниеВзаимодействия = МассивРезультаров[1].Выгрузить();
		//++ #Б-3856 смарт: Фролов 17.07.2025 //Ошибка. Расхождение в механизмах расчета состояния партнера!
		ТабЗапланированныеВзаимодействия = МассивРезультаров[13].Выгрузить();
		ТабМенеджеров = МассивРезультаров[12].Выгрузить();
		//-- #Б-3856 смарт: Фролов 17.07.2025
		ТабЗакрепленные = МассивРезультаров[3].Выгрузить();
		ТабПоследниеЗвонки = МассивРезультаров[4].Выгрузить();
		ТабПредельныеСроки = МассивРезультаров[5].Выгрузить();
		ТабПредельныеСроки = МассивРезультаров[5].Выгрузить();
		
		//++ #Б-2484 смарт: Фролов 07.03.2025 //Ввод нового регламента СЦ. Доработка механизма заполнения регистра Состояние партнеров.
		ТабПоследниеВзаимодействияСЦ = МассивРезультаров[8].Выгрузить();
		ТабЗапланированныеВзаимодействияСЦ = МассивРезультаров[9].Выгрузить();
		//-- #Б-2484 смарт: Фролов 07.03.2025
		
		//++ #Б-6096 смарт: Фролов 24.03.2026 //Доработки регламента РМ.
		//++ #Б-2782 смарт: Фролов 25.03.2025 //Ввод нового регламента РМ. Доработка механизма заполнения регистра Состояние партнеров.
		ТабПоследниеВзаимодействияРМ = МассивРезультаров[6].Выгрузить();
		//ТабЗапланированныеВзаимодействияРМ = МассивРезультаров[7].Выгрузить(); 
		ТабЗапланированныеВзаимодействияРМ = МассивРезультаров[14].Выгрузить();
		//-- #Б-2782 смарт: Фролов 25.03.2025
		//-- #Б-6096 смарт: Фролов 24.03.2026
		
		//++ #Б-3070 смарт: Фролов 16.04.2025 //Ошибка. Исправить различие в расчете состояний партнеров при проведении взаимодействий.
		ТабДатыПродажРМ = МассивРезультаров[11].Выгрузить();
		СтрокаТабДатыПродажРМ = ТабДатыПродажРМ.Найти(Партнер, "Партнер");
		
		Если НЕ СтрокаТабДатыПродажРМ = Неопределено Тогда
			ДатаПоследнейПродажиРМ = СтрокаТабДатыПродажРМ.ДатаПродажиМенеджераРМ;
		Иначе	
			ДатаПоследнейПродажиРМ = Дата("00010101");
		КонецЕсли;
		//-- #Б-3070 смарт: Фролов 16.04.2025
		
		НаборЗаписей = РегистрыСведений.смартСостояниеПартнеров.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Партнер.Установить(Партнер);
		НаборЗаписей.Прочитать();
		
		//++ #Б-3856 смарт: Фролов 17.07.2025 //Ошибка. Расхождение в механизмах расчета состояния партнера!
		СтрокаТабМенеджеров = ТабМенеджеров.Найти(Партнер.ОсновнойМенеджер, "Менеджер");
		Если НЕ СтрокаТабМенеджеров = Неопределено Тогда
			ДнейОтсрочки = СтрокаТабМенеджеров.ДнейОтсрочки;
			ДнейИспользовано = СтрокаТабМенеджеров.ДнейИспользовано;
			ДнейОтпуска = СтрокаТабМенеджеров.ДнейОтпуска;
			ПоследняяДатаОтсрочки = СтрокаТабМенеджеров.ПоследняяДатаОтсрочки;
		Иначе	
			ДнейИспользовано = 0;
			ДнейОтсрочки = 0;
			ДнейОтпуска = 0;
			ПоследняяДатаОтсрочки = Дата("00010101");
		КонецЕсли;
		
		СтрокаТабМенеджеров = ТабМенеджеров.Найти(Партнер.смартОсновнойМенеджерСервисЦентра, "Менеджер");
		Если НЕ СтрокаТабМенеджеров = Неопределено Тогда
			ДнейОтсрочкиСЦ = СтрокаТабМенеджеров.ДнейОтсрочки;
			ДнейИспользованоСЦ = СтрокаТабМенеджеров.ДнейИспользовано;
			ДнейОтпускаСЦ = СтрокаТабМенеджеров.ДнейОтпуска;
			ПоследняяДатаОтсрочкиСЦ = СтрокаТабМенеджеров.ПоследняяДатаОтсрочки;
		Иначе	
			ДнейИспользованоСЦ = 0;
			ДнейОтсрочкиСЦ = 0;
			ДнейОтпускаСЦ = 0;
			ПоследняяДатаОтсрочкиСЦ = Дата("00010101");
		КонецЕсли;
		
		СтрокаТабМенеджеров = ТабМенеджеров.Найти(Партнер.смартМенеджерПоРасходнымМатериалам, "Менеджер");
		Если НЕ СтрокаТабМенеджеров = Неопределено Тогда
			ДнейОтсрочкиРМ = СтрокаТабМенеджеров.ДнейОтсрочки;
			ДнейИспользованоРМ = СтрокаТабМенеджеров.ДнейИспользовано;
			ДнейОтпускаРМ = СтрокаТабМенеджеров.ДнейОтпуска;
			ПоследняяДатаОтсрочкиРМ = СтрокаТабМенеджеров.ПоследняяДатаОтсрочки;
		Иначе	
			ДнейИспользованоРМ = 0;
			ДнейОтсрочкиРМ = 0;
			ДнейОтпускаРМ = 0;
			ПоследняяДатаОтсрочкиРМ = Дата("00010101");
		КонецЕсли;
		
		Если НаборЗаписей.Количество() > 0 Тогда
			ПредыдущееСостояние = НаборЗаписей[0].Состояние;	
			ПредыдущееСостояниеСЦ = НаборЗаписей[0].СостояниеСЦ;
			ПредыдущееСостояниеРМ = НаборЗаписей[0].СостояниеРМ;
		Иначе
			ПредыдущееСостояние = Перечисления.смартСостоянияПартнеров.Свободен;	
			ПредыдущееСостояниеСЦ = Перечисления.смартСостоянияПартнеров.Свободен;
			ПредыдущееСостояниеРМ = Перечисления.смартСостоянияПартнеров.Свободен;
		КонецЕсли;
		//-- #Б-3856 смарт: Фролов 17.07.2025
		
		//++ #Б-2642 смарт: Фролов 12.03.2025 //Ошибка в механизме "Нового регламента СЦ"
		СрокКонтроляВзаимодействийСЦ = Справочники.смартПредопределенныеЗначения.Настройки.СрокКонтроляВзаимодействийСЦ;
		//-- #Б-2642 смарт: Фролов 12.03.2025
		
		//++ #Б-2782 смарт: Фролов 25.03.2025 //Ввод нового регламента РМ. Доработка механизма заполнения регистра Состояние партнеров.
		СрокКонтроляВзаимодействийРМ = Справочники.смартПредопределенныеЗначения.Настройки.СрокКонтроляВзаимодействийРМ;
		//-- #Б-2782 смарт: Фролов 25.03.2025
		
		//++ #Б-6096 смарт: Фролов 23.03.2026 //Доработки регламента РМ.
		ИспользоватьНовыйМеханизмРасчетаСостоянияРМ = Справочники.смартПредопределенныеЗначения.Настройки.ИспользоватьНовыйМеханизмРасчетаСостоянияРМ;
		//-- #Б-6096 смарт: Фролов 23.03.2026
		
		ЕстьИзменения = Ложь;
		
		СтрокаТабПоследниеВзаимодействия = ТабПоследниеВзаимодействия.Найти(Партнер, "Партнер");
		СтрокаТабЗапланированныеВзаимодействия = ТабЗапланированныеВзаимодействия.Найти(Партнер, "Партнер");
		СтрокаТабЗакрепленные = ТабЗакрепленные.Найти(Партнер, "Партнер");
		СтрокаТабПоследниеЗвонки = ТабПоследниеЗвонки.Найти(Партнер, "Партнер");
		СтрокаТабПредельныеСроки = ТабПредельныеСроки.Найти(Партнер, "Партнер");
		//++ #Б-2484 смарт: Фролов 07.03.2025 //Ввод нового регламента СЦ. Доработка механизма заполнения регистра Состояние партнеров.
		СтрокаТабПоследниеВзаимодействияСЦ = ТабПоследниеВзаимодействияСЦ.Найти(Партнер, "Партнер");
		СтрокаТабЗапланированныеВзаимодействияСЦ = ТабЗапланированныеВзаимодействияСЦ.Найти(Партнер, "Партнер");
		
		Если НЕ СтрокаТабПоследниеВзаимодействияСЦ = Неопределено Тогда
			ДатаПоследнегоВзаимодействияСЦ = СтрокаТабПоследниеВзаимодействияСЦ.ДатаПоследнегоВзаимодействия;
		Иначе	
			ДатаПоследнегоВзаимодействияСЦ = Дата("00010101");
		КонецЕсли;
		
		Если НЕ СтрокаТабЗапланированныеВзаимодействияСЦ = Неопределено Тогда
			ДатаЗапланированногоВзаимодействияСЦ = СтрокаТабЗапланированныеВзаимодействияСЦ.ДатаЗапланированногоВзаимодействия;
		Иначе	
			ДатаЗапланированногоВзаимодействияСЦ = Дата("00010101");
		КонецЕсли;
		//-- #Б-2484 смарт: Фролов 07.03.2025
		
		//++ #Б-2782 смарт: Фролов 25.03.2025 //Ввод нового регламента РМ. Доработка механизма заполнения регистра Состояние партнеров.
		СтрокаТабПоследниеВзаимодействияРМ = ТабПоследниеВзаимодействияРМ.Найти(Партнер, "Партнер");
		СтрокаТабЗапланированныеВзаимодействияРМ = ТабЗапланированныеВзаимодействияРМ.Найти(Партнер, "Партнер");
		
		Если НЕ СтрокаТабПоследниеВзаимодействияРМ = Неопределено Тогда
			ДатаПоследнегоВзаимодействияРМ = СтрокаТабПоследниеВзаимодействияРМ.ДатаПоследнегоВзаимодействия;
		Иначе	
			ДатаПоследнегоВзаимодействияРМ = Дата("00010101"); 
		КонецЕсли;
		
		Если НЕ СтрокаТабЗапланированныеВзаимодействияРМ = Неопределено Тогда
			ДатаЗапланированногоВзаимодействияРМ = СтрокаТабЗапланированныеВзаимодействияРМ.ДатаЗапланированногоВзаимодействия;
			//++ #Б-6096 смарт: Фролов 23.03.2026 //Доработки регламента РМ.
			ДатаДокументаЗаплВзмдРМ = СтрокаТабЗапланированныеВзаимодействияРМ.Дата;
			//-- #Б-6096 смарт: Фролов 24.03.2026
		Иначе	
			ДатаЗапланированногоВзаимодействияРМ = Дата("00010101");
			//++ #Б-6096 смарт: Фролов 23.03.2026 //Доработки регламента РМ.
			ДатаДокументаЗаплВзмдРМ = Дата("00010101");
			//-- #Б-6096 смарт: Фролов 24.03.2026
		КонецЕсли;
		//-- #Б-2782 смарт: Фролов 25.03.2025
		
		//++ #Б-3070 смарт: Фролов 16.04.2025 //Ошибка. Исправить различие в расчете состояний партнеров при проведении взаимодействий.
		Если ДатаПоследнегоВзаимодействияРМ < ДатаПоследнейПродажиРМ Тогда
			ДатаПоследнегоВзаимодействияРМ = ДатаПоследнейПродажиРМ;	
		КонецЕсли;
		//-- #Б-3070 смарт: Фролов 16.04.2025
		
		Если НЕ СтрокаТабПредельныеСроки = Неопределено Тогда
			ИзменениеПредельногоСрока = СтрокаТабПредельныеСроки.ПредельныйСрок - 30;
			ИзменениеПредельногоСрокаБезИнтереса = СтрокаТабПредельныеСроки.ПредельныйСрок - 60;
		Иначе	
			ИзменениеПредельногоСрока = 0;
			ИзменениеПредельногоСрокаБезИнтереса = 0;
		КонецЕсли;
		
		Если НЕ СтрокаТабПоследниеЗвонки = Неопределено Тогда
			ДатаПоследнегоЗвонка = СтрокаТабПоследниеЗвонки.ДатаПоследнегоЗвонка;
		Иначе	
			ДатаПоследнегоЗвонка = Дата("00010101");
		КонецЕсли;
		
		Если НЕ СтрокаТабПоследниеВзаимодействия = Неопределено Тогда
			ДатаПоследнегоВзаимодействия = СтрокаТабПоследниеВзаимодействия.ДатаПоследнегоВзаимодействия;
		Иначе	
			ДатаПоследнегоВзаимодействия = Дата("00010101");
		КонецЕсли; 
		
		Если НЕ СтрокаТабЗапланированныеВзаимодействия = Неопределено Тогда
			
			//Дата касания определяется как дата последнего завершенного взаимодействия, но при условии,
			// что +/- 30 дней от него есть запланированное взаимодействие (по дате документа)
			
			ДатаЗапланированногоВзаимодействия = СтрокаТабЗапланированныеВзаимодействия.ДатаЗапланированногоВзаимодействия;
			ДатаДокументаЗаплВзмд = СтрокаТабЗапланированныеВзаимодействия.Дата;
			Если НачалоДня(ДатаПоследнегоВзаимодействия) + 3600 * 24 * 30 > НачалоДня(ДатаДокументаЗаплВзмд)
				И НачалоДня(ДатаДокументаЗаплВзмд) > НачалоДня(ДатаПоследнегоВзаимодействия) - 3600 * 24 * 30 Тогда
				
				ДатаКасания = ДатаПоследнегоВзаимодействия;
				
			Иначе	
				
				ДатаКасания = Дата("00010101");
				
			КонецЕсли;
			
			//++ #Б-3856 смарт: Фролов 17.07.2025 //Ошибка. Расхождение в механизмах расчета состояния партнера!
			Если СтрокаТабЗапланированныеВзаимодействия.СогласованоУвеличенияПлановогоСрока Тогда
				СогласованоУвеличенияПлановогоСрока = Истина;	
			Иначе	
				СогласованоУвеличенияПлановогоСрока = Ложь;
			КонецЕсли;
			//-- #Б-3856 смарт: Фролов 17.07.2025
			
		Иначе
			
			ДатаЗапланированногоВзаимодействия = Дата("00010101");
			ДатаКасания = Дата("00010101");
			
			//++ #Б-3856 смарт: Фролов 17.07.2025 //Ошибка. Расхождение в механизмах расчета состояния партнера!
			СогласованоУвеличенияПлановогоСрока = Ложь;
			//-- #Б-3856 смарт: Фролов 17.07.2025
			
		КонецЕсли;
 		
		Если НЕ СтрокаТабЗакрепленные = Неопределено Тогда
			
			Закреплен = ?(ЗначениеЗаполнено(СтрокаТабЗакрепленные.Менеджер), Истина, Ложь);
			ПериодЗакрепления = СтрокаТабЗакрепленные.Период;
			
			Если ПериодЗакрепления > ДатаПоследнегоВзаимодействия Тогда
				ДатаПоследнегоВзаимодействия = ПериодЗакрепления;
			КонецЕсли;
			
		Иначе
			
			Закреплен = Ложь;
			
		КонецЕсли;

		Если НЕ ТабИнтересы.Найти(Партнер, "Партнер") = Неопределено Тогда
			ЕстьИнтерес = Истина;
		Иначе
			ЕстьИнтерес = Ложь;
		КонецЕсли;
		
		Если ДатаПоследнегоЗвонка < Дата("20241215") И НачалоДня(ДатаПоследнегоЗвонка) + 3600 * 24 * 60 > НачалоДня(ТекущаяДата()) Тогда
			ДатаПоследнегоЗвонкаПоСтарому = Истина
		Иначе
			ДатаПоследнегоЗвонкаПоСтарому = Ложь
		КонецЕсли;
		
		//Определение нового состояния партнера:
		//1. Закрепленные вообще не трогаем
		//2. НеСвободен (В работе), если; 
		//Если дата последнего завершенного взаимодействия не более чем 30 дней от текущей и Дата касания не пустая
		//Если есть интерес и Дата касания не более чем 30 дней от текущей, при условии, что запланированное взаимодействие не просрочено более 2 дней
		//Если интереса нет, то дата касания не болжна быть более 60 дней от текущей, и также при условии, что запланированное взаимодействие не просрочено более 2 дней
		//3. Всё остальное Свободен
		
		//++ #Б-3856 смарт: Фролов 17.07.2025 //Ошибка. Расхождение в механизмах расчета состояния партнера!
		Если Закреплен Тогда
			НовоеСостояние = Перечисления.смартСостоянияПартнеров.Закреплен;
		ИначеЕсли (НачалоДня(ДатаПоследнегоВзаимодействия) + 3600 * 24 * 30 > НачалоДня(ТекущаяДата()) ИЛИ ДатаПоследнегоЗвонкаПоСтарому) 
			И НЕ ДатаКасания = Дата("00010101") Тогда
			НовоеСостояние = Перечисления.смартСостоянияПартнеров.НеСвободен;
		ИначеЕсли НачалоДня(ДатаЗапланированногоВзаимодействия) + 3600 * 24 * 2 > НачалоДня(ТекущаяДата())
			И (НачалоДня(ДатаКасания) + 3600 * 24 * 30 > НачалоДня(ТекущаяДата()) ИЛИ СогласованоУвеличенияПлановогоСрока) И ЕстьИнтерес Тогда
			НовоеСостояние = Перечисления.смартСостоянияПартнеров.НеСвободен;
		ИначеЕсли НачалоДня(ДатаЗапланированногоВзаимодействия) + 3600 * 24 * 2 > НачалоДня(ТекущаяДата())
			И (НачалоДня(ДатаКасания) + 3600 * 24 * 60 > НачалоДня(ТекущаяДата()) ИЛИ СогласованоУвеличенияПлановогоСрока)И НЕ ЕстьИнтерес Тогда
			НовоеСостояние = Перечисления.смартСостоянияПартнеров.НеСвободен;
		Иначе
			НовоеСостояние = Перечисления.смартСостоянияПартнеров.Свободен;
		КонецЕсли;
		//-- #Б-3856 смарт: Фролов 17.07.2025
		
		//++ #Б-3856 смарт: Фролов 17.07.2025 //Ошибка. Расхождение в механизмах расчета состояния партнера!
		Если ПредыдущееСостояние = Перечисления.смартСостоянияПартнеров.НеСвободен
			И НовоеСостояние = Перечисления.смартСостоянияПартнеров.Свободен 
			И НачалоДня(ПоследняяДатаОтсрочки) >= НачалоДня(ТекущаяДата()) Тогда
			НовоеСостояние = Перечисления.смартСостоянияПартнеров.НеСвободен;
		КонецЕсли;
		//-- #Б-3856 смарт: Фролов 17.07.2025
		
		//Определение когда освободится клиент:
		//1. Закрепленные вообще не трогаем
		//2. Если нет интереса, дата касания не пустая и нет просроченного более чем на два дня взаимодействия, то станет свободным через 60 дней от даты касания
		//3. Если интерес есть, дата касания не пустая и нет просроченного более чем на два дня взаимодействия, то станет свободным через 30 дней от даты касания
		//4. Все остальное 0
		
		Если НЕ Закреплен И НачалоДня(ДатаЗапланированногоВзаимодействия) + 3600 * 24 * 2 > НачалоДня(ТекущаяДата()) 
			И НЕ ДатаКасания = Дата("00010101") И НЕ ЕстьИнтерес Тогда 
			
			СтанетСвободнымЧерез = (НачалоДня(ДатаКасания) + 3600 * 24 * (60 + ИзменениеПредельногоСрокаБезИнтереса) - НачалоДня(ТекущаяДата())) / (60 * 60 * 24);
			
		ИначеЕсли НЕ Закреплен И НачалоДня(ДатаЗапланированногоВзаимодействия) + 3600 * 24 * 2 > НачалоДня(ТекущаяДата()) 
			И НЕ ДатаКасания = Дата("00010101") И ЕстьИнтерес Тогда 
			
			СтанетСвободнымЧерез = (НачалоДня(ДатаКасания) + 3600 * 24 * (30 + ИзменениеПредельногоСрока) - НачалоДня(ТекущаяДата())) / (60 * 60 * 24);	
			
		//++ #Б-3856 смарт: Фролов 17.07.2025 //Ошибка. Расхождение в механизмах расчета состояния партнера!
		ИначеЕсли ПредыдущееСостояние = Перечисления.смартСостоянияПартнеров.НеСвободен
			И ДнейОтсрочки > 0 Тогда
			
			СтанетСвободнымЧерез = ДнейОтсрочки;
			
		ИначеЕсли СогласованоУвеличенияПлановогоСрока И ДатаЗапланированногоВзаимодействия > НачалоДня(ТекущаяДата()) Тогда
				
			СтанетСвободнымЧерез = Цел((ДатаЗапланированногоВзаимодействия - НачалоДня(ТекущаяДата())) / (60 * 60 * 24)) + 2;			
			
		//-- #Б-3856 смарт: Фролов 17.07.2025
	
	    Иначе
				
			СтанетСвободнымЧерез = 0;
			
		КонецЕсли;
		
		Если НаборЗаписей.Количество() > 0 Тогда
			
			Если НЕ НаборЗаписей[0].СтанетСвободнымЧерез = СтанетСвободнымЧерез Тогда
				НаборЗаписей[0].СтанетСвободнымЧерез  = СтанетСвободнымЧерез;
				ЕстьИзменения = Истина;
			КонецЕсли;
			
			Если НЕ НаборЗаписей[0].ДатаЗапланированногоВзаимодействия = ДатаЗапланированногоВзаимодействия Тогда
				НаборЗаписей[0].ДатаЗапланированногоВзаимодействия  = ДатаЗапланированногоВзаимодействия;
				ЕстьИзменения = Истина;
			КонецЕсли;
			
			Если НЕ НаборЗаписей[0].ДатаПоследнегоВзаимодействия = ДатаПоследнегоВзаимодействия Тогда
				НаборЗаписей[0].ДатаПоследнегоВзаимодействия  = ДатаПоследнегоВзаимодействия;
				ЕстьИзменения = Истина;
			КонецЕсли;
			
			Если НЕ НаборЗаписей[0].ДатаПоследнегоЗвонка = ДатаПоследнегоЗвонка Тогда
				НаборЗаписей[0].ДатаПоследнегоЗвонка  = ДатаПоследнегоЗвонка;
				ЕстьИзменения = Истина;
			КонецЕсли;
			
			//++ #Б-2484 смарт: Фролов 07.03.2025 //Ввод нового регламента СЦ. Доработка механизма заполнения регистра Состояние партнеров.
			Если НЕ НаборЗаписей[0].ДатаЗапланированногоВзаимодействияСЦ = ДатаЗапланированногоВзаимодействияСЦ Тогда
				НаборЗаписей[0].ДатаЗапланированногоВзаимодействияСЦ = ДатаЗапланированногоВзаимодействияСЦ;
				ЕстьИзменения = Истина;
			КонецЕсли;
			
			//++ #Б-2852 смарт: Фролов 08.04.2025 //Реализовать возможность присваивать Архивное "Состояние СЦ" Менеджерами СЦ
			//Добавил ограничение по статусу, Архивный не трогаем
			Если НЕ НаборЗаписей[0].СостояниеСЦ = Перечисления.смартСостоянияПартнеров.Архивный Тогда
			
				Если ЗначениеЗаполнено(ДатаПоследнегоВзаимодействияСЦ) И НачалоДня(ДатаПоследнегоВзаимодействияСЦ) + 3600 * 24 * 
					СрокКонтроляВзаимодействийСЦ > НачалоДня(ТекущаяДата()) Тогда
					
					//++ #Б-2642 смарт: Фролов 12.03.2025 //Ошибка в механизме "Нового регламента СЦ"
					НаборЗаписей[0].СтанетСвободнымЧерезСЦ = (НачалоДня(ДатаПоследнегоВзаимодействияСЦ) + 3600 * 24 
						* СрокКонтроляВзаимодействийСЦ - НачалоДня(ТекущаяДата())) / (60 * 60 * 24);
					НаборЗаписей[0].СостояниеСЦ = Перечисления.смартСостоянияПартнеров.НеСвободен;
					ЕстьИзменения = Истина;
					//-- #Б-2642 смарт: Фролов 12.03.2025
					
				//++ #Б-3856 смарт: Фролов 17.07.2025 //Ошибка. Расхождение в механизмах расчета состояния партнера!
				ИначеЕсли ПредыдущееСостояниеСЦ = Перечисления.смартСостоянияПартнеров.НеСвободен
					И ДнейОтсрочкиСЦ > 0 Тогда
					
					НаборЗаписей[0].СтанетСвободнымЧерезСЦ = ДнейОтсрочкиСЦ;
					НаборЗаписей[0].СостояниеСЦ = Перечисления.смартСостоянияПартнеров.НеСвободен;
					ЕстьИзменения = Истина;
					
				КонецЕсли;
				//-- #Б-3856 смарт: Фролов 17.07.2025
			
			КонецЕсли;
			//-- #Б-2852 смарт: Фролов 09.04.2025
			
			//++ #Б-2782 смарт: Фролов 25.03.2025 //Ввод нового регламента РМ. Доработка механизма заполнения регистра Состояние партнеров.
			Если НЕ НаборЗаписей[0].ДатаЗапланированногоВзаимодействияРМ = ДатаЗапланированногоВзаимодействияРМ Тогда
				НаборЗаписей[0].ДатаЗапланированногоВзаимодействияРМ = ДатаЗапланированногоВзаимодействияРМ;
				ЕстьИзменения = Истина;
			КонецЕсли;
			
			//++ #Б-6096 смарт: Фролов 23.03.2026 //Доработки регламента РМ.
			Если ИспользоватьНовыйМеханизмРасчетаСостоянияРМ Тогда
				
				//++ #Б-6490 смарт: Фролов 15.04.2026 //Доработка регламента РМ.
				//Если НачалоДня(ДатаПоследнегоВзаимодействияРМ) + 3600 * 24 * 30 > НачалоДня(ДатаДокументаЗаплВзмдРМ)
				//	И НачалоДня(ДатаДокументаЗаплВзмдРМ) > НачалоДня(ДатаПоследнегоВзаимодействияРМ) - 3600 * 24 * 30 Тогда
				Если НачалоДня(ДатаПоследнегоВзаимодействияРМ) + 3600 * 24 * СрокКонтроляВзаимодействийРМ > НачалоДня(ДатаДокументаЗаплВзмдРМ)
					И НачалоДня(ДатаДокументаЗаплВзмдРМ) > НачалоДня(ДатаПоследнегоВзаимодействияРМ) - 3600 * 24 * СрокКонтроляВзаимодействийРМ Тогда 
				//-- #Б-6490 смарт: Фролов 15.04.2026
					
					ДатаКасанияРМ = ДатаПоследнегоВзаимодействияРМ;
					
				Иначе	
					
					ДатаКасанияРМ = Дата("00010101");
					
				КонецЕсли;
				
				Если (НачалоДня(ДатаПоследнегоВзаимодействияРМ) + 3600 * 24 * СрокКонтроляВзаимодействийРМ + 3600 > НачалоДня(ТекущаяДата())
					И НачалоДня(ДатаЗапланированногоВзаимодействияРМ) + 3600 * 24 * 2 > НачалоДня(ТекущаяДата())
					И НЕ ДатаКасанияРМ = Дата("00010101")) Тогда 
										
					НаборЗаписей[0].СтанетСвободнымЧерезРМ = (НачалоДня(ДатаКасанияРМ) + 3600 * 24 * СрокКонтроляВзаимодействийРМ - НачалоДня(ТекущаяДата())) / (60 * 60 * 24);
									
					НаборЗаписей[0].СостояниеРМ = Перечисления.смартСостоянияПартнеров.НеСвободен;
					ЕстьИзменения = Истина;
					
				ИначеЕсли ПредыдущееСостояниеРМ = Перечисления.смартСостоянияПартнеров.НеСвободен
					И ДнейОтсрочкиРМ > 0 Тогда
					
					НаборЗаписей[0].СтанетСвободнымЧерезРМ = ДнейОтсрочкиРМ;
					НаборЗаписей[0].СостояниеРМ = Перечисления.смартСостоянияПартнеров.НеСвободен;
					ЕстьИзменения = Истина;
					
				ИначеЕсли НЕ ПредыдущееСостояниеРМ = Перечисления.смартСостоянияПартнеров.Свободен Тогда
					
					НаборЗаписей[0].СтанетСвободнымЧерезРМ = 0;
					НаборЗаписей[0].СостояниеРМ = Перечисления.смартСостоянияПартнеров.Свободен;
					ЕстьИзменения = Истина;

				КонецЕсли;
				
			Иначе
				
				Если ЗначениеЗаполнено(ДатаПоследнегоВзаимодействияРМ) И НачалоДня(ДатаПоследнегоВзаимодействияРМ) + 3600 * 24 * 
					СрокКонтроляВзаимодействийРМ > НачалоДня(ТекущаяДата()) Тогда
					
					НаборЗаписей[0].СтанетСвободнымЧерезРМ = (НачалоДня(ДатаПоследнегоВзаимодействияРМ) + 3600 * 24 
						* СрокКонтроляВзаимодействийРМ - НачалоДня(ТекущаяДата())) / (60 * 60 * 24);
					НаборЗаписей[0].СостояниеРМ = Перечисления.смартСостоянияПартнеров.НеСвободен;
					ЕстьИзменения = Истина;
					
				//++ #Б-3856 смарт: Фролов 17.07.2025 //Ошибка. Расхождение в механизмах расчета состояния партнера!
				ИначеЕсли ПредыдущееСостояниеРМ = Перечисления.смартСостоянияПартнеров.НеСвободен
					И ДнейОтсрочкиРМ > 0 Тогда
					
					НаборЗаписей[0].СтанетСвободнымЧерезРМ = ДнейОтсрочкиРМ;
					НаборЗаписей[0].СостояниеРМ = Перечисления.смартСостоянияПартнеров.НеСвободен;
					ЕстьИзменения = Истина;
				//-- #Б-3856 смарт: Фролов 17.07.2025
					
				КонецЕсли;
				//-- #Б-2782 смарт: Фролов 25.03.2025 
			
			КонецЕсли;
			//-- #Б-6096 смарт: Фролов 23.03.2026
		
			Если НЕ НаборЗаписей[0].Состояние = НовоеСостояние Тогда
				
				Если НаборЗаписей[0].Состояние = Перечисления.смартСостоянияПартнеров.Закреплен 
					И НовоеСостояние = Перечисления.смартСостоянияПартнеров.Свободен Тогда
					
					МенеджерЗаписи = РегистрыСведений.смартИсторияЗакрепленияПартнеров.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = ТекущаяДата();
					МенеджерЗаписи.Партнер = Партнер;
					МенеджерЗаписи.ТипУслуги = Справочники.CRM_ТипУслуги.ПоставкаТоварыУслуги;
					МенеджерЗаписи.Менеджер = Неопределено;
					МенеджерЗаписи.Записать(Истина);
					
				КонецЕсли;	
				
				НаборЗаписей[0].ПредыдущееСостояние = НаборЗаписей[0].Состояние;
				НаборЗаписей[0].ДатаСменыСостояния = ?(НовоеСостояние = Перечисления.смартСостоянияПартнеров.Закреплен, ПериодЗакрепления, ТекущаяДата());
				НаборЗаписей[0].Состояние = НовоеСостояние;
				ЕстьИзменения = Истина;
				
			КонецЕсли;	
			
			Если ЕстьИзменения Тогда
				
				НаборЗаписей.Записать(Истина);
				
			КонецЕсли;
			
		Иначе
			
			СтрНаборЗаписей = НаборЗаписей.Добавить();
			СтрНаборЗаписей.Партнер = Партнер;
			
			СтрНаборЗаписей.Состояние = НовоеСостояние;
			СтрНаборЗаписей.ДатаПоследнегоВзаимодействия = ДатаПоследнегоВзаимодействия;
			СтрНаборЗаписей.ДатаЗапланированногоВзаимодействия = ДатаЗапланированногоВзаимодействия;
			СтрНаборЗаписей.ДатаПоследнегоЗвонка  = ДатаПоследнегоЗвонка;
			СтрНаборЗаписей.СтанетСвободнымЧерез = СтанетСвободнымЧерез;
			
			НаборЗаписей.Записать(Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	//-- #Б-2372 смарт: Фролов 18.02.2025
	
КонецПроцедуры //-- #1929 смарт: Фролов 23.07.2024

&ИзменениеИКонтроль("ПередЗаписью")
//++ #Б-2354 смарт: Фролов 17.02.2025 //Ввод нового регламента. Вывод данных из регистра состояние партнеров.
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ЗаписьНовогоВзаимодействия", ЭтоНовый());
	ДополнительныеСвойства.Вставить("СтатусВзаимодействияПередЗаписью", Ссылка.СтатусВзаимодействия);

	Если ЗначениеЗаполнено(ДокументОснование) Тогда

		УстановитьПривилегированныйРежим(Истина);

		МетаданныеДокументаОснования = ДокументОснование.Метаданные();

		Если НЕ ЗначениеЗаполнено(КонтактноеЛицо)
			И CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("КонтактноеЛицо", МетаданныеДокументаОснования)
			Тогда
			КонтактноеЛицо = ДокументОснование.КонтактноеЛицо;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Партнер) И НЕ ЗначениеЗаполнено(ПотенциальныйКлиент) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес") Тогда
			Партнер = ДокументОснование.Партнер;
			Если CRM_ОбщегоНазначенияСервер.ЕстьРеквизитДокумента("ПотенциальныйКлиент", МетаданныеДокументаОснования) Тогда
				ПотенциальныйКлиент = ДокументОснование.ПотенциальныйКлиент;
			КонецЕсли;
		КонецЕсли;

		УстановитьПривилегированныйРежим(Ложь);

		Если НЕ ЗначениеЗаполнено(ПлановаяДатаЗавершение) ИЛИ
			ПлановаяДатаЗавершение < ПлановаяДата Тогда
			ПлановаяДатаЗавершение = ПлановаяДата + 60*15;
		КонецЕсли;

	КонецЕсли;

	Если ЗначениеЗаполнено(Ответственный) Тогда
		МассивСтрок	= СвоиЛица.НайтиСтроки(Новый Структура("Лицо", Ответственный));
		Если МассивСтрок.Количество() = 0 Тогда
			НоваяСтрока	= СвоиЛица.Вставить(0);
			НоваяСтрока.Лицо	= Ответственный;
			КонтактнаяИнформация	= CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюПоТипуКИ(Ответственный, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			Если КонтактнаяИнформация.Количество() > 0 Тогда
				НоваяСтрока.Адрес	= КонтактнаяИнформация[0].Представление;
			КонецЕсли;
			НоваяСтрока.ПосетитМероприятие	= 1;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		МассивСтрок	= СторонниеЛица.НайтиСтроки(Новый Структура("КонтактноеЛицо", КонтактноеЛицо));
		Если МассивСтрок.Количество() = 0 Тогда
			НоваяСтрока	= СторонниеЛица.Вставить(0);
			НоваяСтрока.КонтактноеЛицо	= КонтактноеЛицо;
			НоваяСтрока.Партнер	= КонтактноеЛицо.Владелец;
			КонтактнаяИнформация	= CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюПоТипуКИ(КонтактноеЛицо, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			Если КонтактнаяИнформация.Количество() > 0 Тогда
				НоваяСтрока.Адрес	= КонтактнаяИнформация[0].Представление;
			КонецЕсли;
			НоваяСтрока.ПосетитМероприятие	= 1;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Партнер) Тогда
		МассивСтрок	= СторонниеЛица.НайтиСтроки(Новый Структура("Партнер", Партнер));
		Если МассивСтрок.Количество() = 0 Тогда
			НоваяСтрока	= СторонниеЛица.Вставить(0);
			НоваяСтрока.Партнер	= Партнер;
			КонтактнаяИнформация	= CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюПоТипуКИ(Партнер, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			Если КонтактнаяИнформация.Количество() > 0 Тогда
				НоваяСтрока.Адрес	= КонтактнаяИнформация[0].Представление;
			КонецЕсли;
			НоваяСтрока.ПосетитМероприятие	= 1;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ПотенциальныйКлиент) Тогда
		МассивСтрок	= СторонниеЛица.НайтиСтроки(Новый Структура("ПотенциальныйКлиент", ПотенциальныйКлиент));
		Если МассивСтрок.Количество() = 0 Тогда
			НоваяСтрока	= СторонниеЛица.Вставить(0);
			НоваяСтрока.ПотенциальныйКлиент	= ПотенциальныйКлиент;
			КонтактнаяИнформация	= CRM_ОбщегоНазначенияСервер.ПолучитьКонтактнуюИнформациюПоТипуКИ(ПотенциальныйКлиент, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			Если КонтактнаяИнформация.Количество() > 0 Тогда
				НоваяСтрока.Адрес	= КонтактнаяИнформация[0].Представление;
			КонецЕсли;
			НоваяСтрока.ПосетитМероприятие	= 1;
		КонецЕсли;
	КонецЕсли;

	СписокКлиентов = "";
	Для Каждого Стр Из СторонниеЛица Цикл
		Если ЗначениеЗаполнено(Стр.КонтактноеЛицо) Тогда
			СписокКлиентов = СписокКлиентов + ?(СписокКлиентов = "", "", "; ") + Строка(Стр.КонтактноеЛицо);
		ИначеЕсли ЗначениеЗаполнено(Стр.Партнер) Тогда
			СписокКлиентов = СписокКлиентов + ?(СписокКлиентов = "", "", "; ") + Строка(Стр.Партнер);
		ИначеЕсли ЗначениеЗаполнено(Стр.ПотенциальныйКлиент) Тогда
			СписокКлиентов = СписокКлиентов + ?(СписокКлиентов = "", "", "; ") + Строка(Стр.ПотенциальныйКлиент);
		КонецЕсли;	
	КонецЦикла;
	СписокУчастников = "";
	Для Каждого Стр из СвоиЛица Цикл
		СписокУчастников = СписокУчастников + ?(СписокУчастников="", "", "; ") + Строка(Стр.Лицо);
	КонецЦикла;

	Если ПометкаУдаления И НЕ Отказ Тогда
		СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДокументОснование) И (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.CRM_Интерес")) Тогда
		ТаблицаСвязей = Новый ТаблицаЗначений;
		ТаблицаСвязей.Колонки.Добавить("Ссылка");
		ТаблицаСвязей.Колонки.Добавить("СостояниеИнтереса");
		ТаблицаСвязей.Колонки.Добавить("ВведенНаОсновании");
		ТаблицаСвязей.Колонки.Добавить("ОсновнойИнтерес");
		НоваяСтрока = ТаблицаСвязей.Добавить();
		НоваяСтрока.Ссылка 				= ДокументОснование;
		НоваяСтрока.СостояниеИнтереса	= СостояниеИнтереса;
		НоваяСтрока.ВведенНаОсновании	= Ложь;
		НоваяСтрока.ОсновнойИнтерес		= Истина;
		ДополнительныеСвойства.Вставить("CRM_ТаблицаИнтересов", ТаблицаСвязей);
	КонецЕсли;
	
	#Вставка
	//++ #Б-2354 смарт: Фролов 17.02.2025 //Ввод нового регламента. Вывод данных из регистра состояние партнеров.
	Если ЗначениеЗаполнено(Партнер) И НЕ ЗначениеЗаполнено(ДокументОснование)
		//++ #Б-2752 смарт: Фролов 20.03.2025 //Корректировка условия по планированию нескольких взаимодействий по одному менеджеру.
		И НЕ ЗначениеЗаполнено(смартВидЗадачи)
		//-- #Б-2752 смарт: Фролов 20.03.2025
		И НЕ (СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено
		ИЛИ СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка КАК Ссылка
		|ИЗ
		|	Документ.CRM_Взаимодействие
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И НЕ СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
		|	И НЕ СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Отменено)
		|	И Ответственный = Партнер.ОсновнойМенеджер
		|	И Партнер = &Партнер
		//++ #Б-2752 смарт: Фролов 20.03.2025 //Корректировка условия по планированию нескольких взаимодействий по одному менеджеру.
		|	И смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.ПустаяСсылка)
		//-- #Б-2752 смарт: Фролов 20.03.2025
		|	И НЕ ДокументОснование ССЫЛКА Документ.CRM_Интерес
		|	И 1 = 1
		|	И Ответственный = &Ответственный");
		Запрос.УстановитьПараметр("Партнер", Партнер);
		Запрос.УстановитьПараметр("Ответственный", Ответственный);
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "НЕ Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
		КонецЕсли;	
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначения.СообщитьПользователю("По партнеру " + Партнер + " уже есть запланированное взаимодействие; "
				+ Выборка.Ссылка + " завершите его прежде чем формировать новое!", Выборка.Ссылка, , , Отказ);
		КонецЦикла;	
	
	КонецЕсли;
	//-- #Б-2354 смарт: Фролов 17.02.2025
	#КонецВставки 
	
	#Вставка
	//++ #Б-6696 смарт: Фролов 30.04.2026 //Ошибка при закрытии ПНР.
	//++ #Б-2292 смарт: Фролов 20.02.2025 //При создании взаимодействия по партнеру проверять чтобы контактное лицо в нем было из этого партнера.
	//Если ЗначениеЗаполнено(Партнер) И ЗначениеЗаполнено(КонтактноеЛицо) Тогда
	Если ЗначениеЗаполнено(Партнер) И ЗначениеЗаполнено(КонтактноеЛицо) И НЕ смартВидЗадачи = Справочники.смартВидыЗадач.ЗвонокПослеПНР Тогда
	//-- #Б-6696 смарт: Фролов 30.04.2026
		
		Если НЕ Партнер = КонтактноеЛицо.Владелец Тогда
			
			ОбщегоНазначения.СообщитьПользователю("Контактное лицо " + КонтактноеЛицо 
				+ " принадлежит другому партнеру " + КонтактноеЛицо.Владелец + " запись не возможна!", КонтактноеЛицо.Владелец);
			Отказ = Истина;	
				
		КонецЕсли;	
		
	КонецЕсли;
	//-- #Б-2292 смарт: Фролов 20.02.2025
	#КонецВставки
	
	#Вставка
	//++ #Б-2208 смарт: Фролов 25.02.2025 //Ввод нового регламента. Сделать возможным согласование Взаимодействий менеджеров
	ПредельныйСрок = смартОбщегоНазначения.ПулучитьПредельныйСрокВзаимодействияПоПартнеру(Партнер);
	Если ПредельныйСрок > 0 Тогда
		
		смартПредельнаяДатаПланирования = Дата + 3600 * 24 * ПредельныйСрок;	
		
	Иначе
		
		смартПредельнаяДатаПланирования = ПлановаяДата + 1;
		
	КонецЕсли;	
	//-- #Б-2208 смарт: Фролов 25.02.2025
	
	//++ #Б-6346 смарт: Фролов 14.05.2026 //Взаимодействие. Внедрение контроля за встречами со связями к интересам.
	Если ВидВзаимодействия = Справочники.CRM_ВидыВзаимодействий.ВыезднаяВстречаИнтерес
		ИЛИ ВидВзаимодействия = Справочники.CRM_ВидыВзаимодействий.ВыезднаяВстречаПартнер Тогда
		
		смартВидЗадачи = Справочники.смартВидыЗадач.ВыезднаяВстреча;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Ссылка КАК Ссылка
		|ИЗ
		|	Документ.CRM_Взаимодействие
		|ГДЕ
		|	(СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Запланировано)
		|			ИЛИ СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.ВРаботе))
		|	И (ПлановаяДата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИЛИ ПлановаяДатаЗавершение МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИЛИ &ДатаНачала МЕЖДУ ПлановаяДата И ПлановаяДатаЗавершение
		|			ИЛИ &ДатаОкончания МЕЖДУ ПлановаяДата И ПлановаяДатаЗавершение)
		|	И Ответственный = &Ответственный 
		|	И НЕ Ссылка = &Ссылка
		|	И (ВидВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыВзаимодействий.ВыезднаяВстречаИнтерес)
		|			ИЛИ ВидВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыВзаимодействий.ВыезднаяВстречаПартнер))");
		Запрос.УстановитьПараметр("ДатаНачала", ПлановаяДата);
		Запрос.УстановитьПараметр("ДатаОкончания", ПлановаяДатаЗавершение);
		Запрос.УстановитьПараметр("Ответственный", Ответственный);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() > 0 Тогда
			
			ОбщегоНазначения.СообщитьПользователю("В указанном диапазоне уже запланированы следующие взаимодействия:",,,, Отказ);
			
			Пока Выборка.Следующий() Цикл
				
				ОбщегоНазначения.СообщитьПользователю(Выборка.Ссылка, Выборка.Ссылка);	
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;	
	//-- #Б-6346 смарт: Фролов 14.05.2026
	#КонецВставки

КонецПроцедуры //-- #Б-2354 смарт: Фролов 17.02.2025

#КонецОбласти
